app/Controllers/Admin.php

SELECT *
FROM `products`
---
    public function products()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->findAll();

INSERT INTO `products` (`name`, `slug`, `description`, `price`, `stock`, `image`) VALUES ('Polo', 'polo', '', '500', '50', '1764180850_262b30a4a3197e056a9b.jpg')
---
            'image' => $imageName,
        ];

        $productModel->insert($data);