app/Controllers/Home.php

SELECT *
FROM `products`
WHERE `is_featured` = 1
---
    public function index()
    {
        $productModel = new ProductModel();
        $data['products'] = $productModel->where('is_featured', 1)->findAll();