app/Controllers/Product.php

SELECT *
FROM `products`
ORDER BY `name` ASC
---
    public function browse()
    {
        $model = new ProductModel();
        $search = $this->request->getGet('search');
        $sort = $this->request->getGet('sort') ?? 'name';

        $query = $model;

        if ($search) {
            $query = $query->like('name', $search)->orLike('description', $search);
        }

        // Sort options
        switch($sort) {
            case 'price_low':
                $query = $query->orderBy('price', 'ASC');
                break;
            case 'price_high':
                $query = $query->orderBy('price', 'DESC');
                break;
            case 'newest':
                $query = $query->orderBy('id', 'DESC');
                break;
            default:
                $query = $query->orderBy('name', 'ASC');
        }

        $data['products'] = $query->findAll();